In [1]:
print("Hello, Jupyter")

Hello, Jupyter

In [2]:
2+2

4

In [3]:
import numpy as np

arr = np.array([1, 2, 3, 4, 5])

In [4]:
print(arr.mean())

3.0

In [9]:
import pandas as pd  

# Create a simple dataset
data = {
    "name": ["Alice", "Bob", "Charlie", "Diana"],   # <-- comma here is crucial
    "age": [25, 30, 35, 40],
    "score": [85, 90, 95, 100]
}

df = pd.DataFrame(data)  # turn it into a DataFrame (table)

df

      name  age  score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95
3    Diana   40    100

In [10]:
print(df["age"] + 10)

0    35
1    40
2    45
3    50
Name: age, dtype: int64

In [11]:
print(df["score"] * 1.1)

0     93.5
1     99.0
2    104.5
3    110.0
Name: score, dtype: float64

In [19]:
df["salary"] = [30000, 40000, 55000, 75000]
df

      name  age  score  salary
0    Alice   25     85   30000
1      Bob   30     90   40000
2  Charlie   35     95   55000
3    Diana   40    100   75000

In [21]:
high_salary = df[df["salary"] > 50000]
print(high_salary)

      name  age  score  salary
2  Charlie   35     95   55000
3    Diana   40    100   75000

In [29]:
filtered = df[(df["salary"] > 50000) & (df["age"] < 36)]
filtered

      name  age  score  salary
2  Charlie   35     95   55000

In [30]:
df_sorted = df.sort_values(by="score", ascending=False)
df_sorted

      name  age  score  salary
3    Diana   40    100   75000
2  Charlie   35     95   55000
1      Bob   30     90   40000
0    Alice   25     85   30000

In [31]:
df_age_sorted = df.sort_values(by="age", ascending=True)
df_age_sorted

      name  age  score  salary
0    Alice   25     85   30000
1      Bob   30     90   40000
2  Charlie   35     95   55000
3    Diana   40    100   75000

In [33]:
df_filtered = df[df["age"] > 30] # Filter people older than 30

df_filtered = df_filtered[["name", "salary"]] # Select only 2 columns

df_filtered_sorted = df_filtered.sort_values(by="salary", ascending=False)

df_filtered_sorted

      name  salary
3    Diana   75000
2  Charlie   55000